---
kind: other
id: Properties.T:Autodesk.Revit.DB.Structure.RebarConstrainedHandle
source: html/b120cf29-2caf-3f29-a0e1-995e2c24311b.htm
---
# RebarConstrainedHandle Properties

Specifies whether the .NET object represents a valid Revit entity.